load-test/campaigns/2026-08-10_batch-read-overlap/scenarios/overlap-fixed-300.yml
# 고정 부하 라운드 — 300 arrivals/s. 사전 등록: ../README.md §6
#
# 본은 08-09 캠페인의 scenarios/mode-fixed-300.yml이다. **바뀐 것은 measure 길이 하나(60→120초)뿐이고,
# 요청 믹스·가중치·태그 파라미터·size=10은 한 글자도 다르지 않다.** 이 캠페인이 비교하는 축은
# 배치의 착지점(place_stats vs places)이라, 읽기 쪽은 두 팔에서 완전히 같아야 한다.
#
# measure를 두 배로 늘린 이유는 **한 라운드 안에 창 두 개를 넣기 위해서다.** 이 캠페인은 무배치
# 라운드를 따로 두지 않고, 같은 라운드의 앞 구간이 바닥값(대조 창)을 제공한다:
#
#   t0+150  measure 진입 (300 arrivals/s 정상상태)
#   t0+160  대조 창 열림   — waits C0 + digest 비움
#   t0+175  대조 창 닫힘   — digest 덤프(control) + waits C1
#   t0+190  배치 창 열림   — census(pre) + waits B0 + digest 비움 → 배치 발화
#   t0+270  measure 종료
#
# 60초짜리 measure로는 배치 발화 자리가 남지 않는다. 창 오프셋은 tools/run-round.sh가 t0(artillery의
# 첫 "Phase started") 기준 sleep으로 들고 있다 — **phase 길이를 바꾸면 그 상수도 함께 바꿔야 한다.**
#
# 사다리 w1~w5(150초)는 본 그대로이고 전부 측정에서 제외한다. 이 사다리는 같은 호스트에서 네 캠페인
# 동안 목표 부하까지 붕괴 없이 올라간 이력이 있다(폐기 라운드의 근거는 08-09 시나리오 주석에 남아 있다).
# size 10은 운영 기본값(PlaceService.DEFAULT_PAGE_SIZE)이다.
#
# phases는 단독 정의한다 — `environments`는 phase 배열을 원소 단위로 병합해 기본 프로파일이
# 잔존한다 (#381 측정 폐기 원인, load-test/README.md §5).
config:
  target: "http://localhost:8082"
  payload:
    path: "../../../data/users.csv"
    fields:
      - token
    order: random
    skipHeader: true
  # 커서에는 필터 지문이 박혀 있다 — 2페이지에서 태그가 달라지면 서버가 400으로 거절한다.
  # 그래서 태그는 요청마다가 아니라 시나리오 단위로 고정되는 config.variables로 뽑는다.
  variables:
    subA: [7, 8, 9, 10]             # OPTION1, parent = 1
    subB: [11, 12, 13, 14, 15, 16]  # OPTION2, parent = 1
  phases:
    - name: "w1-60"
      duration: 30
      arrivalRate: 60
    - name: "w2-120"
      duration: 30
      arrivalRate: 120
    - name: "w3-180"
      duration: 30
      arrivalRate: 180
    - name: "w4-240"
      duration: 30
      arrivalRate: 240
    - name: "w5-hold"
      duration: 30
      arrivalRate: 300
    - name: "measure"
      duration: 120
      arrivalRate: 300
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  # ── 무태그 ────────────────────────────────────────────────────────────────
  - name: "popular-town"
    weight: 25
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: "{{ $randomNumber(301, 318) }}"
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 10
          name: "popular-town-p1"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "latest-town"
    weight: 15
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: "{{ $randomNumber(301, 318) }}"
            isBookmarkSearch: false
            sort: "LATEST"
            size: 10
          name: "latest-town-p1"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "popular-city-scroll"
    weight: 20
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 10
          name: "popular-city-p1"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "cursorPop"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 10
            cursor: "{{ cursorPop }}"
          name: "popular-city-p2"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "cursorPop"

  # ── 태그 필터 (b24185a 개선 대상 경로) ─────────────────────────────────────
  - name: "popular-city-tag3-scroll"
    weight: 25
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 10
          name: "popular-city-tag3-p1"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "cursorTagPop"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 10
            cursor: "{{ cursorTagPop }}"
          name: "popular-city-tag3-p2"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "cursorTagPop"

  - name: "latest-city-tag3-scroll"
    weight: 15
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "LATEST"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 10
          name: "latest-city-tag3-p1"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "cursorTagLat"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "LATEST"
            mainTagId: 1
            subTagAIdList: "{{ subA }}"
            subTagBIdList: "{{ subB }}"
            size: 10
            cursor: "{{ cursorTagLat }}"
          name: "latest-city-tag3-p2"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "cursorTagLat"